app/views/orders/_form.html.erb

SELECT  "menus".* FROM "menus" WHERE (DATE(date) = '2016-08-03')  ORDER BY "menus"."id" ASC LIMIT 1
---
    <%= f.label :menu %><br>
    <%= f.select :menu, ['Menu 1', 'Menu 2']%>