app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
---

      <td><%= order.order_status%></td>