app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
	def index
		@menus=Menu.all

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@menu = Menu.find(params[:id])

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@menu = Menu.find(params[:id])

INSERT INTO "menus" ("date", "title", "first_dish", "second_dish", "dessert", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@menu = Menu.new(menu_params)
		if @menu.save

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "menus" SET "date" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["date", "2016-12-22"], ["updated_at", "2016-08-02 10:02:35.080763"], ["id", 1]]
---
	def update
		@menu = Menu.find(params[:id])
		if @menu.update(menu_params)

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "menus" WHERE "menus"."id" = ?  [["id", 8]]
---
    def destroy
    @menu = Menu.find(params[:id])
    @menu.destroy