app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 6]]
---
 	def destroy
 		@order = Order.find(params[:id])
 		@order.destroy

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 5]]
---
 def edit
 	@order = Order.find(params[:id])

INSERT INTO "orders" ("name", "email", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "macacua"], ["email", "macaua@macaua.com"], ["phone", "432423432"], ["address", "dasdadadsasd"], ["created_at", "2016-08-01 09:19:20.087122"], ["updated_at", "2016-08-01 09:19:20.087122"]]
---
 def create
 	@order = Order.new(order_params)
 	if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "orders" SET "order_code" = ?, "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_code", "855"], ["order_status", "Pending"], ["updated_at", "2016-08-02 11:40:49.732048"], ["id", 1]]
---
 def update
 	@order = Order.find(params[:id])
 	if @order.update(order_params)